[UIAlert_DLC_Genji]
m_strGenjiPOIAvailableBody="指挥官，被称为“守望先锋”的反抗组织已经向他们的一名特工岛田源氏发出了一份APB。这名特工在发现兄弟失踪后擅离职守，已经消灭了几起变种人基地。我们应该在他陷入无法摆脱的困境之前找到他。"

[X2DownloadableContentInfo_GenjiRedux]
GenjiFirstName="源氏"
GenjiLastName="岛田"
GenjiNickName="浪子"

GenjiBackground="岛田源氏有着漫长而复杂的生活。虽然他不想对入侵前的生活说太多，但很显然，他与兄弟半藏的关系越来越糟糕。入侵后，他加入了当地的反抗组织，直到与“守望先锋”的联合行动出错，他险些丧命。因此，守望先锋的医疗负责人齐格勒博士通过将他变成一个机器人挽救了他的生命，这一事实他仍在接受。"

[UIMission_Genji]
m_strFlavorText="源氏给我们的坐标是非常精确的，但由于他的行动，幽浮处于高度戒备状态。我们应该在他们设法封锁该地区之前赶到那里。"
m_strLaunchMission="突袭"
m_strMissionSubtitle="调查任务"
;-----------------------
; NARRATIVE CONTENT
;-----------------------

[X2DownloadableContentInfo_GenjiRedux]

EnableContentLabel="招募源氏?"
EnableContentSummary="通常情况下，源氏应该通过“迷失兄弟行动”获得，这是一个通过PoI链获得的任务。既然这种方法在已经在游玩的游戏中不起作用，而你正处于应该得到他的时候，你想让源氏现在加入你的团队吗？"
EnableContentAcceptLabel="Yes"
EnableContentCancelLabel="No"